#include<stdio.h>
/*第十四章：位运算
	优先级从上而下：
	~：按位求反
		~0101101
		--------
		 1010010

	<<：左移 : 每左移一位，扩大两倍
		110
	   1100
	>>：右移 ：每右移一位，变成原来的二分之一（前提是：没有1被移除时）
		110
		 11

	&：与运算：都是1才是1，否则都是0
		12：1100
	   &10：1010
	   ---------
	        1000
	^：异或运算：不一样为1，一样得0
		00110011
	   ^11000011
	   ----------
	    11110000

	|：按位或运算：都是0才是0，否则是1
		10110110
	   |01100100
	   ---------
	    11110110
*/
/*void main()
{
	//short int i=45,y;
	//y=~i;

	short int i=12,y,j=10;
	//y=i<<1;
	y=i&j;
	printf("y=%d\n",y);
}*/